In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

In [2]:
dic = {"name":["Dinesh","Ravina","Raghav","Sanjay"],
       "Marks":[86,58,67,45],
       "City":["indore","banglour","mumbai","delhi"],
       "subject":["B.com","MSC","Engineering","MBA"]
      }

In [3]:
df = pd.DataFrame(dic)

In [4]:
df

     name  Marks      City      subject
0  Dinesh     86    indore        B.com
1  Ravina     58  banglour          MSC
2  Raghav     67    mumbai  Engineering
3  Sanjay     45     delhi          MBA

In [5]:
df.head(2)

     name  Marks      City subject
0  Dinesh     86    indore   B.com
1  Ravina     58  banglour     MSC

In [6]:
df.to_csv('Friends_csv', index=False)

In [7]:
df.describe()

           Marks
count   4.000000
mean   64.000000
std    17.224014
min    45.000000
25%    54.750000
50%    62.500000
75%    71.750000
max    86.000000

In [8]:
poll = pd.read_csv("Friends_Trian.csv")

In [9]:
poll

   Train no.  Speed      City
0     156456    152    indore
1     789654    125  banglour
2     852741     90    mumbai
3     202654    170     delhi

In [10]:
poll.index = ["first","second","Third","Fourth"]

In [11]:
poll

        Train no.  Speed      City
first      156456    152    indore
second     789654    125  banglour
Third      852741     90    mumbai
Fourth     202654    170     delhi

In [12]:
poll['Speed'][0] = 160

<ipython-input-12-36876aae870b>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  poll['Speed'][0] = 160

In [13]:
poll

        Train no.  Speed      City
first      156456    160    indore
second     789654    125  banglour
Third      852741     90    mumbai
Fourth     202654    170     delhi

In [14]:
ser = pd.Series(np.random.randn(12))

In [15]:
ser

0    -0.930861
1    -1.853345
2     1.366818
3     1.465770
4    -0.261696
5    -0.417662
6     1.307751
7    -1.228296
8     0.673791
9    -0.083004
10    0.451154
11    0.365667
dtype: float64

In [16]:
type(ser)

pandas.core.series.Series

In [17]:
Newfrm = pd.DataFrame(np.random.rand(20,5), index=[np.arange(20)])

In [18]:
Newfrm.head()

          0         1         2         3         4
0  0.639616  0.197345  0.235238  0.254297  0.928096
1  0.334833  0.085284  0.923694  0.975214  0.267598
2  0.788227  0.452967  0.288050  0.260938  0.096581
3  0.579657  0.537426  0.647384  0.421176  0.875440
4  0.936031  0.803866  0.179141  0.641701  0.717267

In [19]:
type(Newfrm)

pandas.core.frame.DataFrame

In [20]:
Newfrm.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [21]:
Newfrm[0][0] = 12

In [22]:
Newfrm.head()

           0         1         2         3         4
0  12.000000  0.197345  0.235238  0.254297  0.928096
1   0.334833  0.085284  0.923694  0.975214  0.267598
2   0.788227  0.452967  0.288050  0.260938  0.096581
3   0.579657  0.537426  0.647384  0.421176  0.875440
4   0.936031  0.803866  0.179141  0.641701  0.717267

In [23]:
Newfrm.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [24]:
Newfrm[0][0] = np.random.rand(1)

In [25]:
Newfrm.head()

          0         1         2         3         4
0  0.136430  0.197345  0.235238  0.254297  0.928096
1  0.334833  0.085284  0.923694  0.975214  0.267598
2  0.788227  0.452967  0.288050  0.260938  0.096581
3  0.579657  0.537426  0.647384  0.421176  0.875440
4  0.936031  0.803866  0.179141  0.641701  0.717267

In [26]:
Newfrm.T    #Transpose

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19
0,0.136430,0.334833,0.788227,0.579657,0.936031,0.752625,0.278662,0.826835,0.744211,0.673550,0.528876,0.256089,0.712851,0.348891,0.452530,0.384395,0.174862,0.963164,0.350207,0.975627
1,0.197345,0.085284,0.452967,0.537426,0.803866,0.025810,0.817152,0.847329,0.331877,0.712869,0.705923,0.291395,0.344746,0.687245,0.950501,0.252830,0.208454,0.977180,0.998969,0.636619
2,0.235238,0.923694,0.288050,0.647384,0.179141,0.219871,0.290114,0.703882,0.891165,0.108029,0.245815,0.192946,0.935864,0.378038,0.946661,0.355717,0.511891,0.858009,0.346088,0.844169
3,0.254297,0.975214,0.260938,0.421176,0.641701,0.326931,0.936928,0.519730,0.060118,0.969732,0.217185,0.024230,0.701732,0.414083,0.819245,0.310949,0.091844,0.486975,0.177553,0.491334
4,0.928096,0.267598,0.096581,0.875440,0.717267,0.870030,0.941355,0.127943,0.173619,0.426157,0.213776,0.637150,0.517525,0.752374,0.692796,0.073767,0.454280,0.213811,0.491843,0.649895

In [27]:
Newfrm.columns

RangeIndex(start=0, stop=5, step=1)

In [28]:
Newfrm.to_numpy()

array([[0.13643048, 0.19734496, 0.23523762, 0.25429729, 0.9280961 ],
       [0.33483348, 0.08528368, 0.92369424, 0.97521374, 0.26759767],
       [0.78822672, 0.45296747, 0.28805041, 0.26093822, 0.09658141],
       [0.57965731, 0.53742637, 0.64738382, 0.42117551, 0.8754403 ],
       [0.93603077, 0.80386573, 0.17914113, 0.6417009 , 0.71726746],
       [0.75262528, 0.02580955, 0.21987101, 0.32693147, 0.87002969],
       [0.27866207, 0.81715198, 0.29011376, 0.936928  , 0.94135517],
       [0.82683527, 0.84732926, 0.70388161, 0.51972956, 0.12794285],
       [0.74421085, 0.33187733, 0.89116518, 0.06011822, 0.17361902],
       [0.67354981, 0.71286893, 0.10802871, 0.96973215, 0.42615716],
       [0.52887578, 0.70592264, 0.24581481, 0.21718491, 0.21377638],
       [0.2560889 , 0.29139529, 0.19294592, 0.02423007, 0.63715004],
       [0.71285126, 0.34474592, 0.93586441, 0.70173244, 0.5175254 ],
       [0.34889061, 0.68724539, 0.37803845, 0.41408328, 0.75237447],
       [0.45252967, 0.950501  , 0.94666072, 0.81924538, 0.69279628],
       [0.38439533, 0.25283023, 0.35571681, 0.31094924, 0.07376727],
       [0.17486179, 0.20845392, 0.5118906 , 0.09184429, 0.45428024],
       [0.96316448, 0.9771796 , 0.8580094 , 0.48697491, 0.21381146],
       [0.3502075 , 0.99896939, 0.34608806, 0.17755258, 0.49184313],
       [0.97562713, 0.6366195 , 0.8441686 , 0.49133391, 0.64989501]])

In [71]:
hed = Newfrm.sort_index(axis=0, ascending=False)

In [72]:
hed.head()

           A         B         C         D         E   0
19  0.975627  0.293053  0.844169  0.491334  0.649895 NaN
18  0.350207  1.097589  0.346088  0.177553  0.491843 NaN
17  0.963164  2.239631  0.858009  0.486975  0.213811 NaN
16  0.174862 -1.268658  0.511891  0.091844  0.454280 NaN
15  0.384395 -0.343599  0.355717  0.310949  0.073767 NaN

In [31]:
hed1 = Newfrm.sort_index(axis=1, ascending=False)

print(hed1.head())

          4         3         2         1         0
0  0.928096  0.254297  0.235238  0.197345  0.136430
1  0.267598  0.975214  0.923694  0.085284  0.334833
2  0.096581  0.260938  0.288050  0.452967  0.788227
3  0.875440  0.421176  0.647384  0.537426  0.579657
4  0.717267  0.641701  0.179141  0.803866  0.936031

In [32]:
type(Newfrm[0])   #Series "one dimention is a one series"

pandas.core.series.Series

In [33]:
frem = Newfrm.copy()

In [34]:
frem[0][1] = 0.558916

In [35]:
frem.head()

          0         1         2         3         4
0  0.136430  0.197345  0.235238  0.254297  0.928096
1  0.558916  0.085284  0.923694  0.975214  0.267598
2  0.788227  0.452967  0.288050  0.260938  0.096581
3  0.579657  0.537426  0.647384  0.421176  0.875440
4  0.936031  0.803866  0.179141  0.641701  0.717267

In [36]:
Newfrm.columns = list("ABCDE")

In [37]:
Newfrm.loc[(Newfrm["A"]>.5) & (Newfrm["E"]>.50)]

           A         B         C         D         E
3   0.579657  0.537426  0.647384  0.421176  0.875440
4   0.936031  0.803866  0.179141  0.641701  0.717267
5   0.752625  0.025810  0.219871  0.326931  0.870030
12  0.712851  0.344746  0.935864  0.701732  0.517525
19  0.975627  0.636619  0.844169  0.491334  0.649895

In [38]:
Newfrm.loc[0,:]

         A         B         C         D         E
0  0.13643  0.197345  0.235238  0.254297  0.928096

In [39]:
Newfrm.loc[:5,'B']

0    0.197345
1    0.085284
2    0.452967
3    0.537426
4    0.803866
5    0.025810
Name: B, dtype: float64

In [40]:
type(Newfrm.loc[:5,'B'])

pandas.core.series.Series

In [41]:
Newfrm.loc[0,0] = 5120    #if not find given value creat it new frame

In [42]:
Newfrm.head()

          A         B         C         D         E       0
0  0.136430  0.197345  0.235238  0.254297  0.928096  5120.0
1  0.334833  0.085284  0.923694  0.975214  0.267598     NaN
2  0.788227  0.452967  0.288050  0.260938  0.096581     NaN
3  0.579657  0.537426  0.647384  0.421176  0.875440     NaN
4  0.936031  0.803866  0.179141  0.641701  0.717267     NaN

In [43]:
Newfrm.drop(0, axis=1).head()

          A         B         C         D         E
0  0.136430  0.197345  0.235238  0.254297  0.928096
1  0.334833  0.085284  0.923694  0.975214  0.267598
2  0.788227  0.452967  0.288050  0.260938  0.096581
3  0.579657  0.537426  0.647384  0.421176  0.875440
4  0.936031  0.803866  0.179141  0.641701  0.717267

In [44]:
Newfrm.loc[0,"B"] = 120.12540

In [45]:
Newfrm.loc[0]["B"]

0    120.1254
Name: B, dtype: float64

In [46]:
 Newfrm.iloc[[0,2],[1,2]]   #find location by only integer comand valuesw

            B         C
0  120.125400  0.235238
2    0.452967  0.288050

In [47]:
Newfrm.reset_index(drop = True, inplace=True)   #permanantly set dataframe as 'copywrite'

In [48]:
Newfrm.head()

          A           B         C         D         E       0
0  0.136430  120.125400  0.235238  0.254297  0.928096  5120.0
1  0.334833    0.085284  0.923694  0.975214  0.267598     NaN
2  0.788227    0.452967  0.288050  0.260938  0.096581     NaN
3  0.579657    0.537426  0.647384  0.421176  0.875440     NaN
4  0.936031    0.803866  0.179141  0.641701  0.717267     NaN

In [49]:
Newfrm["B"] = None

In [50]:
Newfrm.loc[:,"B"].head()

0    None
1    None
2    None
3    None
4    None
Name: B, dtype: object

In [51]:
Newfrm["C"].isnull().head()

0    False
1    False
2    False
3    False
4    False
Name: C, dtype: bool

In [52]:
Newfrm["B"] = np.random.randn(20)

In [53]:
Newfrm.head()

          A         B         C         D         E       0
0  0.136430 -2.054943  0.235238  0.254297  0.928096  5120.0
1  0.334833  0.983687  0.923694  0.975214  0.267598     NaN
2  0.788227 -0.799111  0.288050  0.260938  0.096581     NaN
3  0.579657 -0.085933  0.647384  0.421176  0.875440     NaN
4  0.936031 -1.802906  0.179141  0.641701  0.717267     NaN

In [54]:
df

     name  Marks      City      subject
0  Dinesh     86    indore        B.com
1  Ravina     58  banglour          MSC
2  Raghav     67    mumbai  Engineering
3  Sanjay     45     delhi          MBA

In [55]:
df.iloc[:2,2] = None

In [56]:
df.iloc[2,3] = None

In [57]:
df

     name  Marks    City subject
0  Dinesh     86    None   B.com
1  Ravina     58    None     MSC
2  Raghav     67  mumbai    None
3  Sanjay     45   delhi     MBA

In [58]:
df.dropna()

     name  Marks   City subject
3  Sanjay     45  delhi     MBA

In [59]:
df.iloc[0,1] = 67

In [60]:
df

     name  Marks    City subject
0  Dinesh     67    None   B.com
1  Ravina     58    None     MSC
2  Raghav     67  mumbai    None
3  Sanjay     45   delhi     MBA

In [61]:
df.drop_duplicates(subset=['City'], keep="last")     #Use keep "last", "first", False

     name  Marks    City subject
1  Ravina     58    None     MSC
2  Raghav     67  mumbai    None
3  Sanjay     45   delhi     MBA

In [62]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   name     4 non-null      object
 1   Marks    4 non-null      int64
 2   City     2 non-null      object
 3   subject  3 non-null      object
dtypes: int64(1), object(3)
memory usage: 256.0+ bytes

# Read and Write with Excel

In [63]:
 data = pd.read_excel('DataFram.xlsx', sheet_name='Sheet1')

In [64]:
data

   Train no.  speed      City
0      55415     96    mumbai
1      52365     85     Delhi
2      98569     98  Bangluru
3     874587    110      Pune

In [65]:
data.iloc[0,1] = 120

In [66]:
data

   Train no.  speed      City
0      55415    120    mumbai
1      52365     85     Delhi
2      98569     98  Bangluru
3     874587    110      Pune

In [67]:
data.to_excel('My_Data.xlsx', sheet_name='Sheet2')

In [68]:
data

   Train no.  speed      City
0      55415    120    mumbai
1      52365     85     Delhi
2      98569     98  Bangluru
3     874587    110      Pune